list_players = ["Маша", "Петя", "Саша", "Оля", "Кирилл"]

last_player = list_players[-1]  # TODO Получить последнего участника
reestr = {"Первый участник":list_players[0], 
          "Второй участник":list_players[1], 
          "Третий участник":list_players[2], 
          "четвертый участник":list_players[3], 
          "Пятый участник":list_players[4]}  # TODO Получить первого участника

# TODO Распечатать имя последнего и первого участника
print("Последний участник:", last_player)
print("Первый участник:", reestr["Первый участник"])
